app/controllers/colors_controller.rb

INSERT INTO "colors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "White"], ["created_at", "2018-10-09 07:26:19.806885"], ["updated_at", "2018-10-09 07:26:19.806885"]]
---
  def create
    @color = Color.new color_params

    if @color.save

DELETE FROM "colors" WHERE "colors"."id" = ?  [["id", 1]]
---
  def destroy
    @color.destroy

SELECT  "colors".* FROM "colors" WHERE "colors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_color
    @color = Color.find(params[:id])