app/controllers/products_controller.rb

  def create
    @product = Product.new product_params

    if @product.save
---
INSERT INTO "products" ("name", "description", "created_at", "updated_at", "small_img_file_name", "small_img_content_type", "small_img_file_size", "small_img_updated_at", "big_img_one_file_name", "big_img_one_content_type", "big_img_one_file_size", "big_img_one_updated_at", "big_img_two_file_name", "big_img_two_content_type", "big_img_two_file_size", "big_img_two_updated_at", "product_type", "color", "slug", "brand") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @product.update product_params
---
UPDATE "products" SET "brand" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["brand", "Roon Labs"], ["updated_at", "2018-12-19 18:25:02.988220"], ["id", 6]]

  def show
    @products = Product.all
---
SELECT "products".* FROM "products"

  def find_product
    @product = Product.friendly.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]