app/views/products/_form.html.erb

SELECT "colors".* FROM "colors"
---
    <div class="input-field col s4">
      <%= f.collection_select(:color, Color.all, :id, :name) %>